{
  "url": "https://www.youtube.com/watch?v=LyLM493QVI8",
  "originalTitle": "- [Kettlebell juggling tutorial with slow motion \\| Simple to complex tricks\\\\",
  "originalDescription": "",
  "videoId": "LyLM493QVI8",
  "series": "101",
  "processingIndex": 11,
  "totalVideos": 141,
  "batchNumber": 3,
  "processedAt": "2025-09-22T17:50:39.743Z",
  "foundVia": "Channel search for 101",
  "transcriptSuccess": true,
  "extractionError": null,
  "success": true,
  "videoUrl": "https://www.youtube.com/watch?v=LyLM493QVI8",
  "transcriptText": "Let’s explore some of the classical club swinging exercises, and how to adapt them to do them with a kettlebell. Thierry demonstrates with a 16kg bell, but  a 16kg club would be a very challenging size club.\n\nThe leverage and grip requirements of a club are of course not comparable, and the exercise won’t feel as fluid as if using a club, but sometimes, it’s better to make do rather than not do at all!\n\nClub swinging exercises are done for high reps or timed sets. Sets of 20 reps are a minimum as a general rule.\n\nThe high reps reinforce the new neuro-muscular connections you create by learning new skills, and they help lubricate the joints and strengthen the connective tissues. Leave the powerlifting mentality out of club swinging, and enjoy the flow!\n\nTo learn step by step how to swing Indian clubs,\n\nWHY YOU SHOULD SWING INDIAN CLUBS\n\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\n\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\n\nConsists of compound movements in multiple planes\n\nProvides low impact cardiovascular exercise\n\nAssists recovery from intense training\n\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n\nIt is fun and you forget you are training.\n\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\n\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ HEROIC SPORT | AN ANCIENT SPORT\n\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors.\n\nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n\n❂ READY TO LEARN MORE?\n\nAll our educational material has been tested and structured since 2010, in a way that is easy for anyone to learn from home.\n\nBest regards from Thierry & Ron\n\nhey terry from expo welcome to our channel so today we're going to look at traditional classical engine club exercise of modgar exercise and how to do them with a kettlebell so if you're curious about indian clubs what they can do for you but you're not sure if it's really for you okay the best thing is to try out with a solution that doesn't cost you any money we're going to use kettlebell to experience circular training and we're going to look at a handful of indian club exercises just pick a moderate weight and let's go [Music] front circles at the foundation okay there are circles happening in front of the body in this plane of motion so imagine you got a wall right in front of you you're going to describe a circle like this okay it involves pivoting from side to side shifting your body weight from leg to leg keeping the knees nice and soft now when you're singing is swinging in this plane of motion you can stay with your feet you know shoulder or a bit wider than shoulder width apart for extra stability so with the club this is what it looks like you would bring it to this position here and let it fall okay receive on this side translate to the other side and carry on okay so from the side boom you can see how my whole chest body is following the club with the eyes and pivoting along and of course you want to practice in both directions and because we're holding the club with two hands then you would change the grip and repeat both directions now you can swing the clubs with a single hand it just looks like this right nothing different this would be called an inner circle and going away from the midline of the body would be called the outer circle okay so let's look at it with the kettlebell the way we do it we bring the kettlebell to this bottom up position hands on the horns of the of the bell and exact same motion okay transfer my weight onto that bent leg here let the arms extend bring the weight up now you add a bit of speed make sure that you bring the kettlebell to that bottom up position rotate to the other side and carry on so you don't you know cut the exercise short and let the bell fall otherwise it's going to go in the wrong plane of motion and of course you want to practice in both directions now here in this exercise what you can do as well is practice with a normal clean and you've got your circular clean right boom watch out for the knees if you're used to juggling this move you probably done before with the kettlebell now if you're banging the bell on your forearms what you can do is simply go to the bottom up variation and you'll see this move being done with the now in the indian akaras or indian gyms okay which is basically the inspiration for the center of mass bells so these are the front circles let's check out the next exercise and guys and girls remember to subscribe to our channel and hit the notification bell so you stay up to date with our content [Music] so the back circles are one of the staples of the hindu wrestlers now i'm going to demonstrate here with the paler vandal okay you can just screw them two together so you got a longer leverage creates like a short mace water one and a half liter nice beer by the way uh filled up with sand so we got a three kilo weight at the end of uh roughly uh 45 centimeters or so so we've got a nice leverage and three kilos don't sound much but at the end of that stick here it's you know gives you momentum now here for the back circles okay we start by bringing one shoulder forward the club is going to go over that shoulder and then drop behind the back keep the elbows pointing up when the club is behind the back and do not over arch your back then you turn and bring the club over the other shoulder you see where i end up over the one foot then i'm gonna bring that shoulder forward again make sure that you know your knees are not locked and straight and i repeat the movement and of course we got two directions and it's the same okay now you can also do the variation we just do side to side and you just launch straight into the reverse motion okay but that's the uh back circles now with the kettlebell this is what it looks like now most of you i guess have done a hello before like this very mechanic you know everything squared up and the kettlebell moves around the body well in this variation you have to let you know rotation happen from the feet up okay so we're bringing the one shoulder forward going over the shoulder with the kettlebell and pulling it over the other one as you rotate boom okay so we've got this dynamic rotation here okay hopefully everybody can see that and then of course you have the opposite direction boom and then finally you've got the side to side yeah left foot right foot so this is how you can replicate the back circles with a kettlebell check out the video description for a link to the full article and a 15 minute workout [Music] when you combine a front circle and a back circle into one fluid motion you've got a full swing what some people call the mill the heart shape swing okay different names the important thing is just to do the exercise so let's check it out again i can do this exercise one-handed i'm just demonstrating for the sake of simplicity with two hands okay so i would have my front circle boom and go directly into my back circle yeah i'm gonna show you a back view as well the front circle boom over the shoulder turn pull it down go into the next circle and then you would of course go the other direction okay let's also take a look at the side view so boom so it's like almost like doing a good old-fashioned pull-over with the rotation of the upper body that actually happens right through to the ground as well okay so with the kettlebell boom you're gonna just bring it again to the same position as before elbows in against the body we're going to turn away from the implement okay it's going to fall boom so that rotation of the upper body super important i'm facing my chest is going looking towards the kettlebell and when i pull it down again the chest is or my sternum is facing to the kettlebell okay so we got this whipping type of effect let's check it out from the back view i'm going to do the opposite direction boom okay so at the same time as you have the kettlebell pointing down to the to the ground this is where you rotate okay timing is of the essence in this exercise there are many variations of how you can do the exercise with the uh with the clubs to show you the very basic one okay let's not confuse let's not make things more complicated than they have to [Music] in the reverse eight we're going to swing by the side of the body and actually making the club go into a diagonal type of motion across the body okay so we want to narrow a stance for this exercise from our start position i'm going to look toward the my shoulder here and if you've got any kind of uh you know knee stiffness and and so on maybe you'll find it easier for you to just lift the the heel of the back foot so you can rotate better keep that knee bent as well okay and we're just going to let the club drop come back to the center and go to the other side okay so for this exercise you have to imagine you're into a very narrow corridor you don't want to scrape and damage your beautiful hair export club boom and then from um it will switch the the grip and then show you from the uh you know the side view so you have this boom yeah imagine you got a lightsaber and going whatever sound effect they do okay so this is it now demonstration here with a 16 kilo kelvin it's probably a bit heavy okay you're going to overlap your hands hold the kettlebell in this position and do the same boom try to time your breathing into it and then of course you know to balance things out i would just change the grip and repeat the exercise so okay so that's your reverse eight and done with kell bell it's a bit more like throwing you know uppercuts last exercise we got the horizontal swipe so a swipe is simply a swing that has a definite end point in this case we're going to have bent elbows and have the club resting on the shoulder now it's going to be done horizontally as the name says so basically from side to side we have a slight pivot happening here with the whole body okay then many way you can tweak this exercise many variations you can go into a full lunge you can fully step out to the side you can switch around your back you can switch above your head you know again very basic okay so in this instance i'm going to bring the club to the meaty part of the shoulder i'm going to face away from the camera so 90 degree angle here okay i've got my elbows in here and what i'm going to do is i'm going to swing the club across to the other side and receive over the opposite shoulder okay so i've got a rotation happening here hopefully you could see that you know right in the middle here boom i'm switching the club okay so if this was the sharp edge of my sword this is where i chop and i make sure that i protect myself as i receive it on my shoulder okay as always you know change the grip and repeat now with the kettlebell you know there's not much to other thing here grab again by the horns place it on your shoulder it's going to drop down okay this is the 16 kilo kello bell so it's gonna not going to be as horizontal but you still get the feeling of that exercise provides a really nice rotation right through the spine make sure that you don't stop and look short okay so look really over the opposite side of the body so you get the maximum stretch effect okay here boom keeping the elbows bent okay really also engages your biceps so that's basically it for the horizontal swipe now that you've learned the uh exercises in this video you could put them to use in our 15 minute workout i'll put a link to the video so you can go straight into it if you want to thanks for watching see you later",
  "rawContent": "![Thumbnail (1920x1080)](https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg?v=6093e8d7)\n# [Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell](https://www.youtube.com/watch?v=LyLM493QVI8)\n\n**Visibility**: Public\n**Uploaded by**: [Heroic Sport - Indian clubs workouts](http://www.youtube.com/@HeroicSport)\n**Uploaded at**: 2021-05-13T23:00:58-07:00\n**Published at**: 2021-05-13T23:00:58-07:00\n**Length**: 13:33\n**Views**: 8200\n**Likes**: 251\n**Category**: Sports\n\n## Description\n\n```\nThe kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroicsport.com/2021/05/14/5-indian-club-exercises/\n\nLet’s explore some of the classical club swinging exercises, and how to adapt them to do them with a kettlebell. Thierry demonstrates with a 16kg bell, but  a 16kg club would be a very challenging size club.\n\nThe leverage and grip requirements of a club are of course not comparable, and the exercise won’t feel as fluid as if using a club, but sometimes, it’s better to make do rather than not do at all!\n\nClub swinging exercises are done for high reps or timed sets. Sets of 20 reps are a minimum as a general rule.\nThe high reps reinforce the new neuro-muscular connections you create by learning new skills, and they help lubricate the joints and strengthen the connective tissues. Leave the powerlifting mentality out of club swinging, and enjoy the flow!\n\nGO TO: https://heroicsport.com/product-category/buy-indian-clubs-for-sale/ and check out the whole selection of clubs we have!\n☛DISCOUNT CODE FOR 10% OFF YOUR SET OF ADJUSTABLE INDIAN CLUBS PAHLAVANDLE™: gen9\n\nTo learn step by step how to swing Indian clubs, \nGO TO: https://heroicsport.com/product-category/indian-clubs-education/\n☛DISCOUNT CODE FOR 20% OFF TRAINING VIDEOS: swing101 \n\nWHY YOU SHOULD SWING INDIAN CLUBS\nWatch this: https://www.youtube.com/watch?v=ft-FL_6s_No\n\n〄 PHYSICAL ASPECTS\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\nConsists of compound movements in multiple planes\nProvides low impact cardiovascular exercise\nAssists recovery from intense training\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n〄 MENTAL ASPECTS\nIt is fun and you forget you are training.\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ HEROIC SPORT | AN ANCIENT SPORT \nWe have created the Pahlavandle ™ and the Pahlavandle™XL to make it affordable for everyone to discover the benefits of swinging clubs.\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors. \nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n\n❂ READY TO LEARN MORE?\nWe run instructor certifications (online and live), team building events and offer video downloads on our website at https://heroicsport.com/indian-clubs-online/\nAll our educational material has been tested and structured since 2010, in a way that is easy for anyone to learn from home.\n\n❂ FOLLOW US ON INSTAGRAM https://www.instagram.com/heroic.sport/\nBest regards from Thierry & Ron\n```\n\n## Transcript\n\nhey terry from expo welcome to our channel so today we're going to look at traditional classical engine club exercise of modgar exercise and how to do them with a kettlebell so if you're curious about indian clubs what they can do for you but you're not sure if it's really for you okay the best thing is to try out with a solution that doesn't cost you any money we're going to use kettlebell to experience circular training and we're going to look at a handful of indian club exercises just pick a moderate weight and let's go [Music] front circles at the foundation okay there are circles happening in front of the body in this plane of motion so imagine you got a wall right in front of you you're going to describe a circle like this okay it involves pivoting from side to side shifting your body weight from leg to leg keeping the knees nice and soft now when you're singing is swinging in this plane of motion you can stay with your feet you know shoulder or a bit wider than shoulder width apart for extra stability so with the club this is what it looks like you would bring it to this position here and let it fall okay receive on this side translate to the other side and carry on okay so from the side boom you can see how my whole chest body is following the club with the eyes and pivoting along and of course you want to practice in both directions and because we're holding the club with two hands then you would change the grip and repeat both directions now you can swing the clubs with a single hand it just looks like this right nothing different this would be called an inner circle and going away from the midline of the body would be called the outer circle okay so let's look at it with the kettlebell the way we do it we bring the kettlebell to this bottom up position hands on the horns of the of the bell and exact same motion okay transfer my weight onto that bent leg here let the arms extend bring the weight up now you add a bit of speed make sure that you bring the kettlebell to that bottom up position rotate to the other side and carry on so you don't you know cut the exercise short and let the bell fall otherwise it's going to go in the wrong plane of motion and of course you want to practice in both directions now here in this exercise what you can do as well is practice with a normal clean and you've got your circular clean right boom watch out for the knees if you're used to juggling this move you probably done before with the kettlebell now if you're banging the bell on your forearms what you can do is simply go to the bottom up variation and you'll see this move being done with the now in the indian akaras or indian gyms okay which is basically the inspiration for the center of mass bells so these are the front circles let's check out the next exercise and guys and girls remember to subscribe to our channel and hit the notification bell so you stay up to date with our content [Music] so the back circles are one of the staples of the hindu wrestlers now i'm going to demonstrate here with the paler vandal okay you can just screw them two together so you got a longer leverage creates like a short mace water one and a half liter nice beer by the way uh filled up with sand so we got a three kilo weight at the end of uh roughly uh 45 centimeters or so so we've got a nice leverage and three kilos don't sound much but at the end of that stick here it's you know gives you momentum now here for the back circles okay we start by bringing one shoulder forward the club is going to go over that shoulder and then drop behind the back keep the elbows pointing up when the club is behind the back and do not over arch your back then you turn and bring the club over the other shoulder you see where i end up over the one foot then i'm gonna bring that shoulder forward again make sure that you know your knees are not locked and straight and i repeat the movement and of course we got two directions and it's the same okay now you can also do the variation we just do side to side and you just launch straight into the reverse motion okay but that's the uh back circles now with the kettlebell this is what it looks like now most of you i guess have done a hello before like this very mechanic you know everything squared up and the kettlebell moves around the body well in this variation you have to let you know rotation happen from the feet up okay so we're bringing the one shoulder forward going over the shoulder with the kettlebell and pulling it over the other one as you rotate boom okay so we've got this dynamic rotation here okay hopefully everybody can see that and then of course you have the opposite direction boom and then finally you've got the side to side yeah left foot right foot so this is how you can replicate the back circles with a kettlebell check out the video description for a link to the full article and a 15 minute workout [Music] when you combine a front circle and a back circle into one fluid motion you've got a full swing what some people call the mill the heart shape swing okay different names the important thing is just to do the exercise so let's check it out again i can do this exercise one-handed i'm just demonstrating for the sake of simplicity with two hands okay so i would have my front circle boom and go directly into my back circle yeah i'm gonna show you a back view as well the front circle boom over the shoulder turn pull it down go into the next circle and then you would of course go the other direction okay let's also take a look at the side view so boom so it's like almost like doing a good old-fashioned pull-over with the rotation of the upper body that actually happens right through to the ground as well okay so with the kettlebell boom you're gonna just bring it again to the same position as before elbows in against the body we're going to turn away from the implement okay it's going to fall boom so that rotation of the upper body super important i'm facing my chest is going looking towards the kettlebell and when i pull it down again the chest is or my sternum is facing to the kettlebell okay so we got this whipping type of effect let's check it out from the back view i'm going to do the opposite direction boom okay so at the same time as you have the kettlebell pointing down to the to the ground this is where you rotate okay timing is of the essence in this exercise there are many variations of how you can do the exercise with the uh with the clubs to show you the very basic one okay let's not confuse let's not make things more complicated than they have to [Music] in the reverse eight we're going to swing by the side of the body and actually making the club go into a diagonal type of motion across the body okay so we want to narrow a stance for this exercise from our start position i'm going to look toward the my shoulder here and if you've got any kind of uh you know knee stiffness and and so on maybe you'll find it easier for you to just lift the the heel of the back foot so you can rotate better keep that knee bent as well okay and we're just going to let the club drop come back to the center and go to the other side okay so for this exercise you have to imagine you're into a very narrow corridor you don't want to scrape and damage your beautiful hair export club boom and then from um it will switch the the grip and then show you from the uh you know the side view so you have this boom yeah imagine you got a lightsaber and going whatever sound effect they do okay so this is it now demonstration here with a 16 kilo kelvin it's probably a bit heavy okay you're going to overlap your hands hold the kettlebell in this position and do the same boom try to time your breathing into it and then of course you know to balance things out i would just change the grip and repeat the exercise so okay so that's your reverse eight and done with kell bell it's a bit more like throwing you know uppercuts last exercise we got the horizontal swipe so a swipe is simply a swing that has a definite end point in this case we're going to have bent elbows and have the club resting on the shoulder now it's going to be done horizontally as the name says so basically from side to side we have a slight pivot happening here with the whole body okay then many way you can tweak this exercise many variations you can go into a full lunge you can fully step out to the side you can switch around your back you can switch above your head you know again very basic okay so in this instance i'm going to bring the club to the meaty part of the shoulder i'm going to face away from the camera so 90 degree angle here okay i've got my elbows in here and what i'm going to do is i'm going to swing the club across to the other side and receive over the opposite shoulder okay so i've got a rotation happening here hopefully you could see that you know right in the middle here boom i'm switching the club okay so if this was the sharp edge of my sword this is where i chop and i make sure that i protect myself as i receive it on my shoulder okay as always you know change the grip and repeat now with the kettlebell you know there's not much to other thing here grab again by the horns place it on your shoulder it's going to drop down okay this is the 16 kilo kello bell so it's gonna not going to be as horizontal but you still get the feeling of that exercise provides a really nice rotation right through the spine make sure that you don't stop and look short okay so look really over the opposite side of the body so you get the maximum stretch effect okay here boom keeping the elbows bent okay really also engages your biceps so that's basically it for the horizontal swipe now that you've learned the uh exercises in this video you could put them to use in our 15 minute workout i'll put a link to the video so you can go straight into it if you want to thanks for watching see you later\n\n\n## Endscreen\n    \n- [13 min workout with 1 kettlebell & 1 Indian club/ mudgar/ clubbell](https://www.youtube.com/watch?v=I2rReMnTKh4)\n- [The Ace of clubs |  Follow along workout #4 | Video 21/21](https://www.youtube.com/watch?v=NKH_pKiuM6E)",
  "transcriptLines": 22,
  "wordCount": 2276,
  "metadata": {
    "title": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell - YouTube",
    "favicon": "https://www.youtube.com/s/desktop/fdcc3e7b/img/favicon_32x32.png",
    "og:image:width": "1280",
    "twitter:app:name:ipad": "YouTube",
    "og:video:type": "text/html",
    "al:android:app_name": "YouTube",
    "twitter:image": "https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg",
    "description": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics..., The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
    "name": [
      "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
      "Heroic Sport - Indian clubs workouts"
    ],
    "al:ios:app_name": "YouTube",
    "og:site_name": "YouTube",
    "og:image": "https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg",
    "twitter:title": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
    "playerType": "HTML5 Flash",
    "twitter:url": "https://www.youtube.com/watch?v=LyLM493QVI8",
    "og:video:height": "720",
    "twitter:app:id:ipad": "544007664",
    "theme-color": "rgba(255, 255, 255, 0.98)",
    "twitter:app:name:iphone": "YouTube",
    "og:description": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
    "startDate": "2021-05-14T06:00:58+00:00",
    "al:android:url": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
    "og:url": "https://www.youtube.com/watch?v=LyLM493QVI8",
    "identifier": "LyLM493QVI8",
    "twitter:card": "player",
    "og:type": "video.other",
    "width": [
      "1280",
      "1280"
    ],
    "ogImage": "https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg",
    "regionsAllowed": "AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW",
    "height": [
      "720",
      "720"
    ],
    "interactionType": [
      "https://schema.org/LikeAction",
      "https://schema.org/WatchAction"
    ],
    "viewport": [
      "width=device-width, initial-scale=1.0, viewport-fit=cover",
      "initial-scale=1, minimum-scale=1, width=device-width"
    ],
    "al:ios:app_store_id": "544007664",
    "endDate": "2021-05-14T06:15:41+00:00",
    "ogTitle": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
    "twitter:app:name:googleplay": "YouTube",
    "ogUrl": "https://www.youtube.com/watch?v=LyLM493QVI8",
    "al:ios:url": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
    "al:android:package": "com.google.android.youtube",
    "datePublished": "2021-05-13T23:00:58-07:00",
    "ogDescription": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
    "twitter:app:url:iphone": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
    "isFamilyFriendly": "true",
    "ogSiteName": "YouTube",
    "twitter:app:url:ipad": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
    "position": "1",
    "og:image:height": "720",
    "twitter:description": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
    "keywords": [
      "Indian clubs basics, best indian clubs exercises, how to train with indian clubs, Indian clubs routine, thierry sanchez, pahlavandle, Karlakattai, persian yoga, mugdar, indian clubs workout, shoulder mobility, shoulder pain, neck pain, clubbell, mudgar, mugdal, circular strength, mudgar workout, desi strength",
      "Indian clubs basics,best indian clubs exercises,how to train with indian clubs,Indian clubs routine,thierry sanchez,pahlavandle,Karlakattai,persian yoga,mugdar,indian clubs workout,shoulder mobility,shoulder pain,neck pain,clubbell,mudgar,mugdal,circular strength,mudgar workout,desi strength"
    ],
    "og:video:secure_url": "https://www.youtube.com/embed/LyLM493QVI8",
    "language": "en",
    "og:video:tag": [
      "Indian clubs basics",
      "best indian clubs exercises",
      "how to train with indian clubs",
      "Indian clubs routine",
      "thierry sanchez",
      "pahlavandle",
      "Karlakattai",
      "persian yoga",
      "mugdar",
      "indian clubs workout",
      "shoulder mobility",
      "shoulder pain",
      "neck pain",
      "clubbell",
      "mudgar",
      "mugdal",
      "circular strength",
      "mudgar workout",
      "desi strength"
    ],
    "userInteractionCount": [
      "251",
      "8200"
    ],
    "twitter:app:url:googleplay": "https://www.youtube.com/watch?v=LyLM493QVI8",
    "og:video:width": "1280",
    "twitter:player": "https://www.youtube.com/embed/LyLM493QVI8",
    "twitter:player:height": "720",
    "og:title": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
    "fb:app_id": "87741124305",
    "twitter:site": "@youtube",
    "og:video:url": "https://www.youtube.com/embed/LyLM493QVI8",
    "twitter:app:id:iphone": "544007664",
    "twitter:app:id:googleplay": "com.google.android.youtube",
    "requiresSubscription": "False",
    "isLiveBroadcast": "True",
    "genre": "Sports",
    "duration": "PT13M34S",
    "referrer": "origin-when-cross-origin",
    "uploadDate": "2021-05-13T23:00:58-07:00",
    "al:web:url": "http://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
    "twitter:player:width": "1280",
    "scrapeId": "73132a69-2274-4164-b7ee-50644e5d773d",
    "sourceURL": "https://www.youtube.com/watch?v=LyLM493QVI8",
    "url": "https://www.youtube.com/watch?v=LyLM493QVI8",
    "statusCode": 200,
    "contentType": "text/html; charset=utf-8",
    "proxyUsed": "basic",
    "postprocessorsUsed": [
      "youtube"
    ],
    "creditsUsed": 1
  },
  "extractedAt": "2025-09-22T17:50:39.743Z"
}