{
  "batchNumber": 4,
  "processedAt": "2025-09-23T21:51:13.050Z",
  "videosInBatch": 3,
  "successful": 3,
  "failed": 0,
  "totalWordsExtracted": 6827,
  "totalLinesExtracted": 52,
  "batchInfo": {
    "batchNumber": 4,
    "batchSize": 3,
    "batchStarted": "2025-09-23T21:50:15.922Z"
  },
  "processedVideos": [
    {
      "url": "https://www.youtube.com/watch?v=LyLM493QVI8",
      "originalTitle": "- [Kettlebell juggling tutorial with slow motion \\| Simple to complex tricks\\\\",
      "originalDescription": "",
      "videoId": "LyLM493QVI8",
      "series": "101",
      "processingIndex": 11,
      "totalVideos": 141,
      "batchNumber": 4,
      "processedAt": "2025-09-23T21:50:31.522Z",
      "foundVia": "Channel search for 101",
      "transcriptSuccess": true,
      "extractionError": null,
      "success": true,
      "videoUrl": "https://www.youtube.com/watch?v=LyLM493QVI8",
      "transcriptText": "Let’s explore some of the classical club swinging exercises, and how to adapt them to do them with a kettlebell. Thierry demonstrates with a 16kg bell, but  a 16kg club would be a very challenging size club.\n\nThe leverage and grip requirements of a club are of course not comparable, and the exercise won’t feel as fluid as if using a club, but sometimes, it’s better to make do rather than not do at all!\n\nClub swinging exercises are done for high reps or timed sets. Sets of 20 reps are a minimum as a general rule.\n\nThe high reps reinforce the new neuro-muscular connections you create by learning new skills, and they help lubricate the joints and strengthen the connective tissues. Leave the powerlifting mentality out of club swinging, and enjoy the flow!\n\nTo learn step by step how to swing Indian clubs,\n\nWHY YOU SHOULD SWING INDIAN CLUBS\n\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\n\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\n\nConsists of compound movements in multiple planes\n\nProvides low impact cardiovascular exercise\n\nAssists recovery from intense training\n\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n\nIt is fun and you forget you are training.\n\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\n\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ HEROIC SPORT | AN ANCIENT SPORT\n\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors.\n\nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n\n❂ READY TO LEARN MORE?\n\nAll our educational material has been tested and structured since 2010, in a way that is easy for anyone to learn from home.\n\nBest regards from Thierry & Ron\n\nhey terry from expo welcome to our channel so today we're going to look at traditional classical engine club exercise of modgar exercise and how to do them with a kettlebell so if you're curious about indian clubs what they can do for you but you're not sure if it's really for you okay the best thing is to try out with a solution that doesn't cost you any money we're going to use kettlebell to experience circular training and we're going to look at a handful of indian club exercises just pick a moderate weight and let's go [Music] front circles at the foundation okay there are circles happening in front of the body in this plane of motion so imagine you got a wall right in front of you you're going to describe a circle like this okay it involves pivoting from side to side shifting your body weight from leg to leg keeping the knees nice and soft now when you're singing is swinging in this plane of motion you can stay with your feet you know shoulder or a bit wider than shoulder width apart for extra stability so with the club this is what it looks like you would bring it to this position here and let it fall okay receive on this side translate to the other side and carry on okay so from the side boom you can see how my whole chest body is following the club with the eyes and pivoting along and of course you want to practice in both directions and because we're holding the club with two hands then you would change the grip and repeat both directions now you can swing the clubs with a single hand it just looks like this right nothing different this would be called an inner circle and going away from the midline of the body would be called the outer circle okay so let's look at it with the kettlebell the way we do it we bring the kettlebell to this bottom up position hands on the horns of the of the bell and exact same motion okay transfer my weight onto that bent leg here let the arms extend bring the weight up now you add a bit of speed make sure that you bring the kettlebell to that bottom up position rotate to the other side and carry on so you don't you know cut the exercise short and let the bell fall otherwise it's going to go in the wrong plane of motion and of course you want to practice in both directions now here in this exercise what you can do as well is practice with a normal clean and you've got your circular clean right boom watch out for the knees if you're used to juggling this move you probably done before with the kettlebell now if you're banging the bell on your forearms what you can do is simply go to the bottom up variation and you'll see this move being done with the now in the indian akaras or indian gyms okay which is basically the inspiration for the center of mass bells so these are the front circles let's check out the next exercise and guys and girls remember to subscribe to our channel and hit the notification bell so you stay up to date with our content [Music] so the back circles are one of the staples of the hindu wrestlers now i'm going to demonstrate here with the paler vandal okay you can just screw them two together so you got a longer leverage creates like a short mace water one and a half liter nice beer by the way uh filled up with sand so we got a three kilo weight at the end of uh roughly uh 45 centimeters or so so we've got a nice leverage and three kilos don't sound much but at the end of that stick here it's you know gives you momentum now here for the back circles okay we start by bringing one shoulder forward the club is going to go over that shoulder and then drop behind the back keep the elbows pointing up when the club is behind the back and do not over arch your back then you turn and bring the club over the other shoulder you see where i end up over the one foot then i'm gonna bring that shoulder forward again make sure that you know your knees are not locked and straight and i repeat the movement and of course we got two directions and it's the same okay now you can also do the variation we just do side to side and you just launch straight into the reverse motion okay but that's the uh back circles now with the kettlebell this is what it looks like now most of you i guess have done a hello before like this very mechanic you know everything squared up and the kettlebell moves around the body well in this variation you have to let you know rotation happen from the feet up okay so we're bringing the one shoulder forward going over the shoulder with the kettlebell and pulling it over the other one as you rotate boom okay so we've got this dynamic rotation here okay hopefully everybody can see that and then of course you have the opposite direction boom and then finally you've got the side to side yeah left foot right foot so this is how you can replicate the back circles with a kettlebell check out the video description for a link to the full article and a 15 minute workout [Music] when you combine a front circle and a back circle into one fluid motion you've got a full swing what some people call the mill the heart shape swing okay different names the important thing is just to do the exercise so let's check it out again i can do this exercise one-handed i'm just demonstrating for the sake of simplicity with two hands okay so i would have my front circle boom and go directly into my back circle yeah i'm gonna show you a back view as well the front circle boom over the shoulder turn pull it down go into the next circle and then you would of course go the other direction okay let's also take a look at the side view so boom so it's like almost like doing a good old-fashioned pull-over with the rotation of the upper body that actually happens right through to the ground as well okay so with the kettlebell boom you're gonna just bring it again to the same position as before elbows in against the body we're going to turn away from the implement okay it's going to fall boom so that rotation of the upper body super important i'm facing my chest is going looking towards the kettlebell and when i pull it down again the chest is or my sternum is facing to the kettlebell okay so we got this whipping type of effect let's check it out from the back view i'm going to do the opposite direction boom okay so at the same time as you have the kettlebell pointing down to the to the ground this is where you rotate okay timing is of the essence in this exercise there are many variations of how you can do the exercise with the uh with the clubs to show you the very basic one okay let's not confuse let's not make things more complicated than they have to [Music] in the reverse eight we're going to swing by the side of the body and actually making the club go into a diagonal type of motion across the body okay so we want to narrow a stance for this exercise from our start position i'm going to look toward the my shoulder here and if you've got any kind of uh you know knee stiffness and and so on maybe you'll find it easier for you to just lift the the heel of the back foot so you can rotate better keep that knee bent as well okay and we're just going to let the club drop come back to the center and go to the other side okay so for this exercise you have to imagine you're into a very narrow corridor you don't want to scrape and damage your beautiful hair export club boom and then from um it will switch the the grip and then show you from the uh you know the side view so you have this boom yeah imagine you got a lightsaber and going whatever sound effect they do okay so this is it now demonstration here with a 16 kilo kelvin it's probably a bit heavy okay you're going to overlap your hands hold the kettlebell in this position and do the same boom try to time your breathing into it and then of course you know to balance things out i would just change the grip and repeat the exercise so okay so that's your reverse eight and done with kell bell it's a bit more like throwing you know uppercuts last exercise we got the horizontal swipe so a swipe is simply a swing that has a definite end point in this case we're going to have bent elbows and have the club resting on the shoulder now it's going to be done horizontally as the name says so basically from side to side we have a slight pivot happening here with the whole body okay then many way you can tweak this exercise many variations you can go into a full lunge you can fully step out to the side you can switch around your back you can switch above your head you know again very basic okay so in this instance i'm going to bring the club to the meaty part of the shoulder i'm going to face away from the camera so 90 degree angle here okay i've got my elbows in here and what i'm going to do is i'm going to swing the club across to the other side and receive over the opposite shoulder okay so i've got a rotation happening here hopefully you could see that you know right in the middle here boom i'm switching the club okay so if this was the sharp edge of my sword this is where i chop and i make sure that i protect myself as i receive it on my shoulder okay as always you know change the grip and repeat now with the kettlebell you know there's not much to other thing here grab again by the horns place it on your shoulder it's going to drop down okay this is the 16 kilo kello bell so it's gonna not going to be as horizontal but you still get the feeling of that exercise provides a really nice rotation right through the spine make sure that you don't stop and look short okay so look really over the opposite side of the body so you get the maximum stretch effect okay here boom keeping the elbows bent okay really also engages your biceps so that's basically it for the horizontal swipe now that you've learned the uh exercises in this video you could put them to use in our 15 minute workout i'll put a link to the video so you can go straight into it if you want to thanks for watching see you later",
      "rawContent": "![Thumbnail (1920x1080)](https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg?v=6093e8d7)\n# [Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell](https://www.youtube.com/watch?v=LyLM493QVI8)\n\n**Visibility**: Public\n**Uploaded by**: [Heroic Sport - Indian clubs workouts](http://www.youtube.com/@HeroicSport)\n**Uploaded at**: 2021-05-13T23:00:58-07:00\n**Published at**: 2021-05-13T23:00:58-07:00\n**Length**: 13:33\n**Views**: 8200\n**Likes**: 251\n**Category**: Sports\n\n## Description\n\n```\nThe kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroicsport.com/2021/05/14/5-indian-club-exercises/\n\nLet’s explore some of the classical club swinging exercises, and how to adapt them to do them with a kettlebell. Thierry demonstrates with a 16kg bell, but  a 16kg club would be a very challenging size club.\n\nThe leverage and grip requirements of a club are of course not comparable, and the exercise won’t feel as fluid as if using a club, but sometimes, it’s better to make do rather than not do at all!\n\nClub swinging exercises are done for high reps or timed sets. Sets of 20 reps are a minimum as a general rule.\nThe high reps reinforce the new neuro-muscular connections you create by learning new skills, and they help lubricate the joints and strengthen the connective tissues. Leave the powerlifting mentality out of club swinging, and enjoy the flow!\n\nGO TO: https://heroicsport.com/product-category/buy-indian-clubs-for-sale/ and check out the whole selection of clubs we have!\n☛DISCOUNT CODE FOR 10% OFF YOUR SET OF ADJUSTABLE INDIAN CLUBS PAHLAVANDLE™: gen9\n\nTo learn step by step how to swing Indian clubs, \nGO TO: https://heroicsport.com/product-category/indian-clubs-education/\n☛DISCOUNT CODE FOR 20% OFF TRAINING VIDEOS: swing101 \n\nWHY YOU SHOULD SWING INDIAN CLUBS\nWatch this: https://www.youtube.com/watch?v=ft-FL_6s_No\n\n〄 PHYSICAL ASPECTS\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\nConsists of compound movements in multiple planes\nProvides low impact cardiovascular exercise\nAssists recovery from intense training\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n〄 MENTAL ASPECTS\nIt is fun and you forget you are training.\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ HEROIC SPORT | AN ANCIENT SPORT \nWe have created the Pahlavandle ™ and the Pahlavandle™XL to make it affordable for everyone to discover the benefits of swinging clubs.\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors. \nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n\n❂ READY TO LEARN MORE?\nWe run instructor certifications (online and live), team building events and offer video downloads on our website at https://heroicsport.com/indian-clubs-online/\nAll our educational material has been tested and structured since 2010, in a way that is easy for anyone to learn from home.\n\n❂ FOLLOW US ON INSTAGRAM https://www.instagram.com/heroic.sport/\nBest regards from Thierry & Ron\n```\n\n## Transcript\n\nhey terry from expo welcome to our channel so today we're going to look at traditional classical engine club exercise of modgar exercise and how to do them with a kettlebell so if you're curious about indian clubs what they can do for you but you're not sure if it's really for you okay the best thing is to try out with a solution that doesn't cost you any money we're going to use kettlebell to experience circular training and we're going to look at a handful of indian club exercises just pick a moderate weight and let's go [Music] front circles at the foundation okay there are circles happening in front of the body in this plane of motion so imagine you got a wall right in front of you you're going to describe a circle like this okay it involves pivoting from side to side shifting your body weight from leg to leg keeping the knees nice and soft now when you're singing is swinging in this plane of motion you can stay with your feet you know shoulder or a bit wider than shoulder width apart for extra stability so with the club this is what it looks like you would bring it to this position here and let it fall okay receive on this side translate to the other side and carry on okay so from the side boom you can see how my whole chest body is following the club with the eyes and pivoting along and of course you want to practice in both directions and because we're holding the club with two hands then you would change the grip and repeat both directions now you can swing the clubs with a single hand it just looks like this right nothing different this would be called an inner circle and going away from the midline of the body would be called the outer circle okay so let's look at it with the kettlebell the way we do it we bring the kettlebell to this bottom up position hands on the horns of the of the bell and exact same motion okay transfer my weight onto that bent leg here let the arms extend bring the weight up now you add a bit of speed make sure that you bring the kettlebell to that bottom up position rotate to the other side and carry on so you don't you know cut the exercise short and let the bell fall otherwise it's going to go in the wrong plane of motion and of course you want to practice in both directions now here in this exercise what you can do as well is practice with a normal clean and you've got your circular clean right boom watch out for the knees if you're used to juggling this move you probably done before with the kettlebell now if you're banging the bell on your forearms what you can do is simply go to the bottom up variation and you'll see this move being done with the now in the indian akaras or indian gyms okay which is basically the inspiration for the center of mass bells so these are the front circles let's check out the next exercise and guys and girls remember to subscribe to our channel and hit the notification bell so you stay up to date with our content [Music] so the back circles are one of the staples of the hindu wrestlers now i'm going to demonstrate here with the paler vandal okay you can just screw them two together so you got a longer leverage creates like a short mace water one and a half liter nice beer by the way uh filled up with sand so we got a three kilo weight at the end of uh roughly uh 45 centimeters or so so we've got a nice leverage and three kilos don't sound much but at the end of that stick here it's you know gives you momentum now here for the back circles okay we start by bringing one shoulder forward the club is going to go over that shoulder and then drop behind the back keep the elbows pointing up when the club is behind the back and do not over arch your back then you turn and bring the club over the other shoulder you see where i end up over the one foot then i'm gonna bring that shoulder forward again make sure that you know your knees are not locked and straight and i repeat the movement and of course we got two directions and it's the same okay now you can also do the variation we just do side to side and you just launch straight into the reverse motion okay but that's the uh back circles now with the kettlebell this is what it looks like now most of you i guess have done a hello before like this very mechanic you know everything squared up and the kettlebell moves around the body well in this variation you have to let you know rotation happen from the feet up okay so we're bringing the one shoulder forward going over the shoulder with the kettlebell and pulling it over the other one as you rotate boom okay so we've got this dynamic rotation here okay hopefully everybody can see that and then of course you have the opposite direction boom and then finally you've got the side to side yeah left foot right foot so this is how you can replicate the back circles with a kettlebell check out the video description for a link to the full article and a 15 minute workout [Music] when you combine a front circle and a back circle into one fluid motion you've got a full swing what some people call the mill the heart shape swing okay different names the important thing is just to do the exercise so let's check it out again i can do this exercise one-handed i'm just demonstrating for the sake of simplicity with two hands okay so i would have my front circle boom and go directly into my back circle yeah i'm gonna show you a back view as well the front circle boom over the shoulder turn pull it down go into the next circle and then you would of course go the other direction okay let's also take a look at the side view so boom so it's like almost like doing a good old-fashioned pull-over with the rotation of the upper body that actually happens right through to the ground as well okay so with the kettlebell boom you're gonna just bring it again to the same position as before elbows in against the body we're going to turn away from the implement okay it's going to fall boom so that rotation of the upper body super important i'm facing my chest is going looking towards the kettlebell and when i pull it down again the chest is or my sternum is facing to the kettlebell okay so we got this whipping type of effect let's check it out from the back view i'm going to do the opposite direction boom okay so at the same time as you have the kettlebell pointing down to the to the ground this is where you rotate okay timing is of the essence in this exercise there are many variations of how you can do the exercise with the uh with the clubs to show you the very basic one okay let's not confuse let's not make things more complicated than they have to [Music] in the reverse eight we're going to swing by the side of the body and actually making the club go into a diagonal type of motion across the body okay so we want to narrow a stance for this exercise from our start position i'm going to look toward the my shoulder here and if you've got any kind of uh you know knee stiffness and and so on maybe you'll find it easier for you to just lift the the heel of the back foot so you can rotate better keep that knee bent as well okay and we're just going to let the club drop come back to the center and go to the other side okay so for this exercise you have to imagine you're into a very narrow corridor you don't want to scrape and damage your beautiful hair export club boom and then from um it will switch the the grip and then show you from the uh you know the side view so you have this boom yeah imagine you got a lightsaber and going whatever sound effect they do okay so this is it now demonstration here with a 16 kilo kelvin it's probably a bit heavy okay you're going to overlap your hands hold the kettlebell in this position and do the same boom try to time your breathing into it and then of course you know to balance things out i would just change the grip and repeat the exercise so okay so that's your reverse eight and done with kell bell it's a bit more like throwing you know uppercuts last exercise we got the horizontal swipe so a swipe is simply a swing that has a definite end point in this case we're going to have bent elbows and have the club resting on the shoulder now it's going to be done horizontally as the name says so basically from side to side we have a slight pivot happening here with the whole body okay then many way you can tweak this exercise many variations you can go into a full lunge you can fully step out to the side you can switch around your back you can switch above your head you know again very basic okay so in this instance i'm going to bring the club to the meaty part of the shoulder i'm going to face away from the camera so 90 degree angle here okay i've got my elbows in here and what i'm going to do is i'm going to swing the club across to the other side and receive over the opposite shoulder okay so i've got a rotation happening here hopefully you could see that you know right in the middle here boom i'm switching the club okay so if this was the sharp edge of my sword this is where i chop and i make sure that i protect myself as i receive it on my shoulder okay as always you know change the grip and repeat now with the kettlebell you know there's not much to other thing here grab again by the horns place it on your shoulder it's going to drop down okay this is the 16 kilo kello bell so it's gonna not going to be as horizontal but you still get the feeling of that exercise provides a really nice rotation right through the spine make sure that you don't stop and look short okay so look really over the opposite side of the body so you get the maximum stretch effect okay here boom keeping the elbows bent okay really also engages your biceps so that's basically it for the horizontal swipe now that you've learned the uh exercises in this video you could put them to use in our 15 minute workout i'll put a link to the video so you can go straight into it if you want to thanks for watching see you later\n\n\n## Endscreen\n    \n- [13 min workout with 1 kettlebell & 1 Indian club/ mudgar/ clubbell](https://www.youtube.com/watch?v=I2rReMnTKh4)\n- [The Ace of clubs |  Follow along workout #4 | Video 21/21](https://www.youtube.com/watch?v=NKH_pKiuM6E)",
      "transcriptLines": 22,
      "wordCount": 2276,
      "metadata": {
        "height": [
          "720",
          "720"
        ],
        "og:video:type": "text/html",
        "twitter:player": "https://www.youtube.com/embed/LyLM493QVI8",
        "og:video:url": "https://www.youtube.com/embed/LyLM493QVI8",
        "og:description": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
        "twitter:site": "@youtube",
        "twitter:player:width": "1280",
        "og:video:secure_url": "https://www.youtube.com/embed/LyLM493QVI8",
        "twitter:card": "player",
        "language": "en",
        "og:title": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
        "regionsAllowed": "AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW",
        "og:url": "https://www.youtube.com/watch?v=LyLM493QVI8",
        "interactionType": [
          "https://schema.org/LikeAction",
          "https://schema.org/WatchAction"
        ],
        "og:video:tag": [
          "Indian clubs basics",
          "best indian clubs exercises",
          "how to train with indian clubs",
          "Indian clubs routine",
          "thierry sanchez",
          "pahlavandle",
          "Karlakattai",
          "persian yoga",
          "mugdar",
          "indian clubs workout",
          "shoulder mobility",
          "shoulder pain",
          "neck pain",
          "clubbell",
          "mudgar",
          "mugdal",
          "circular strength",
          "mudgar workout",
          "desi strength"
        ],
        "og:site_name": "YouTube",
        "uploadDate": "2021-05-13T23:00:58-07:00",
        "twitter:app:name:googleplay": "YouTube",
        "identifier": "LyLM493QVI8",
        "twitter:app:id:googleplay": "com.google.android.youtube",
        "twitter:app:url:iphone": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
        "fb:app_id": "87741124305",
        "width": [
          "1280",
          "1280"
        ],
        "ogTitle": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
        "ogUrl": "https://www.youtube.com/watch?v=LyLM493QVI8",
        "ogSiteName": "YouTube",
        "og:video:width": "1280",
        "ogImage": "https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg",
        "og:video:height": "720",
        "playerType": "HTML5 Flash",
        "requiresSubscription": "False",
        "al:android:package": "com.google.android.youtube",
        "keywords": [
          "Indian clubs basics, best indian clubs exercises, how to train with indian clubs, Indian clubs routine, thierry sanchez, pahlavandle, Karlakattai, persian yoga, mugdar, indian clubs workout, shoulder mobility, shoulder pain, neck pain, clubbell, mudgar, mugdal, circular strength, mudgar workout, desi strength",
          "Indian clubs basics,best indian clubs exercises,how to train with indian clubs,Indian clubs routine,thierry sanchez,pahlavandle,Karlakattai,persian yoga,mugdar,indian clubs workout,shoulder mobility,shoulder pain,neck pain,clubbell,mudgar,mugdal,circular strength,mudgar workout,desi strength"
        ],
        "twitter:description": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
        "og:type": "video.other",
        "og:image:width": "1280",
        "genre": "Sports",
        "ogDescription": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
        "theme-color": "rgba(255, 255, 255, 0.98)",
        "startDate": "2021-05-14T06:00:58+00:00",
        "og:image:height": "720",
        "name": [
          "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
          "Heroic Sport - Indian clubs workouts"
        ],
        "al:ios:app_store_id": "544007664",
        "twitter:player:height": "720",
        "position": "1",
        "title": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell - YouTube",
        "al:ios:app_name": "YouTube",
        "twitter:app:id:iphone": "544007664",
        "twitter:app:name:ipad": "YouTube",
        "twitter:app:id:ipad": "544007664",
        "twitter:app:url:ipad": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
        "al:ios:url": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
        "userInteractionCount": [
          "251",
          "8200"
        ],
        "twitter:app:name:iphone": "YouTube",
        "al:android:app_name": "YouTube",
        "twitter:title": "Mugdar exercise workout (Mudgar /Clubbell) | Circular exercises with a kettlebell",
        "twitter:image": "https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg",
        "endDate": "2021-05-14T06:15:41+00:00",
        "twitter:url": "https://www.youtube.com/watch?v=LyLM493QVI8",
        "referrer": "origin-when-cross-origin",
        "al:web:url": "http://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
        "al:android:url": "vnd.youtube://www.youtube.com/watch?v=LyLM493QVI8&feature=applinks",
        "isLiveBroadcast": "True",
        "favicon": "https://www.youtube.com/s/desktop/06be7d2e/img/favicon_32x32.png",
        "duration": "PT13M34S",
        "og:image": "https://i.ytimg.com/vi/LyLM493QVI8/maxresdefault.jpg",
        "isFamilyFriendly": "true",
        "viewport": [
          "width=device-width, initial-scale=1.0, viewport-fit=cover",
          "initial-scale=1, minimum-scale=1, width=device-width"
        ],
        "datePublished": "2021-05-13T23:00:58-07:00",
        "description": "The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics..., The kettlebell, with its offset center of mass can be used as a substitute for some classical club swinging exercises.READ THE WHOLE ARTICLE: https://heroics...",
        "twitter:app:url:googleplay": "https://www.youtube.com/watch?v=LyLM493QVI8",
        "scrapeId": "9092936b-9511-4e5f-bbb0-b90746baa136",
        "sourceURL": "https://www.youtube.com/watch?v=LyLM493QVI8",
        "url": "https://www.youtube.com/watch?v=LyLM493QVI8",
        "statusCode": 200,
        "contentType": "text/html; charset=utf-8",
        "proxyUsed": "basic",
        "postprocessorsUsed": [
          "youtube"
        ],
        "creditsUsed": 1
      },
      "extractedAt": "2025-09-23T21:50:31.522Z"
    },
    {
      "url": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
      "originalTitle": "Series 101 Video",
      "originalDescription": "",
      "videoId": "Wh4T4o3q7z8",
      "series": "101",
      "processingIndex": 13,
      "totalVideos": 141,
      "batchNumber": 4,
      "processedAt": "2025-09-23T21:50:53.308Z",
      "foundVia": "Channel search for 101",
      "transcriptSuccess": true,
      "extractionError": null,
      "success": true,
      "videoUrl": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
      "transcriptText": "And finally, if you can do a circle in one direction, you can reverse that direction.\n\nWith 2 clubs, this allows you to eventually dissociate left from right arm, performing intricate patterns at different tempos.\n\nWhat can Indian clubs do for you?\n\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\n\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\n\nConsists of compound movements in multiple planes\n\nProvides low impact cardiovascular exercise\n\nAssists recovery from intense training\n\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n\nIt is fun and you forget you are training.\n\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\n\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ Heroic Sport | An ancient discipline\n\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors and wrestlers.\n\nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n\nforeign [Music] Circle so we're going to bring the clubs up above our head and we're going to cross the midline straight away and return to the top position now when I reach there I want to alternate my Crossing hands just like we did with the pendulums yeah so work on one rep at a time and when that feels good then you can start having a bit more slow yeah so any type of movement where we cross the midline is defined as a closing movement or an inner type of circle when we're doing the Outer Circle we're going to let our arms fall out to the side and return to the start position so from here I'm just gonna keep the clubs in Pro against my arm cross at the bottom and return to the start just like we did before every time my hands are crossing and changing the leading hand of the top hand if you want again do a few reps of those nice and slow one rep at a time and then when comfortable you flow smoothly from one swing to the next no sudden acceleration strive to maintain a steady reliable casual tempo so if we have a parallel to One Direction of course we have the opposite as well so we've got parallel to the left parallel to the right so here I start at the top again to make it easy during the learning process and I'm going to slightly turn so the clubs are going to be really tight and closed against my body just like if there was a wall in front of me and they're both moving at the same speed so I turn slightly I start to drop I turn and I square up my body as I finish and again when you start feeling the flow of the move then you link the terms again no sudden acceleration keep it nice and smooth and flowy yeah boom now if you have troubles and you feel your arms are about to cross so you don't know exactly what's happening what you can do is just hold on to one club like this so you're going to start here everything is squared up turn to the one side bring the clubs in front of you and lift them up and return to the start yeah so we drop Square lift and then of course practice in both directions so every time that my arms are up or down yeah my body is squared up so there's no Crossing no tangling of the arms after view practice the circles in front of the body we're going to start practicing the circles by the side of the body now it's impossible to move both arms in the same direction at the same time without dislocating the shoulders so here we're going to work on a bit more complex movement we're going to add an element of a rhythm so the first is going to be alternating forward circles yeah so it's like doing the front crawl in the pool boom I can use my leg drive again boom I'm done finish [Music] return to order and then we're going to practice the reverse so I'm going to show different you this time but it's still the same principle one Club starts moving backwards it reaches the bottom position the next one starts yes I'm doing my back crawl [Music] next up we've got the opposite circles so one club is going to move forward and the other one is going to move backwards and this is really emphasizing the rotation through the upper body it's the only way you can do this properly without hurting your shoulders so let's have a look at it in slo-mo boom my body is squared up one Club Falls forward the other one backwards I look at the back Club here I am in the T sort of like both clubs are in line I square up again as my clubs are by the side of the leg I turn to the other side look at my back Club and then I come back and score out my body when they're both overhead so with a bit of speed and you guessed it two directions so now we're going to switch the right hand is going to move forward left is going to go back now what's important when I'm doing those circles by the side of the body is make sure that I stay in the right plane of motion right pain so you go to picture yourself inside a very narrow Corridor where you're basically scraping the walls yeah so there's a difference when I'm doing my back Circle going out wide I'm describing a small circle compared to here really tight against the legs and I'm describing the biggest circle that I can so this is what I want to achieve on every rep the biggest circle around the using the joint that we're supposed to to use so shoulder elbow or wrist doesn't matter same principle applies [Music] okay the next big circles we're going to look at are actually going to take place on the diagonal line so we're going to cross the midline and perform figure eights so it's going to be a tall figure eight instead of a flat cigarette let's look at it order you're going to Simply cross to the one side look at the club you come to the top there and you're going to swing both arms to the other side so we've got a side to side swing nice tight close against my legs so I want to stand with my feet right under my hips so I'm not swinging out wide or hitting my knees yeah let's take a look at the side view so here boom I start and moving forward my Knuckles are driving the movement imagine you're chopping somebody in two halves yeah so the edge of your sword has to be pointing downwards boom [Music] so for the reverse eight we're going to bring one club to order turn and look over that shoulder let both clubs describe a circle by the side of the body and then switch across there's a bit of side bending element in this exercise we are coiling the core harnessing all the power from our midsection to drive the clubs notice I'm still pivoting with my feet as well yeah side view look back boom so this time the knuckles are facing up to the ceiling as we drive the sword from the ground up to the ceiling boom so here's a quick little combination that you can do where you're going to introduce again the element of stepping and turning 90 degrees so just like we did with the pendulums where we start with the Crossing in front of the body and turning to the side into the opposite pendulum we're going to repeat the same sequence but this time we're going to do full circles so we're going to start with the inner and you could also try it with the outer circles and then we're going to turn and it's going to change into the opposite circles where we're going to end up swinging by the side of the body so let's take a look and practice a few times all right so from order I bring the clubs up I start with my first Circle second third and the fourth and without stopping I got one two three and four come back to the center one two three and four to the other side one two three and four back to Center one two three four out of the circle one two three four and turn one two three four back to Center one two three four turn one two three four and back to the center where we close okay so there's a bit of work there for you guys and girls mastering the timing when is it exactly that I have to turn so that do not interrupt the smoothness of the swings and therefore the flow [Music] so now we're going to look at the elbow circles elbow circles are involved when we're doing the heart-shaped swings so this is going to basic and short introduction that will help you build the foundations to learn and progress to the different type of r-shaped swings so the first one we're going to do is from the order position do a front elbow Circle so the clubs is going to swing from order and return to order and you can see when I catch that order I'm not centered but I'm slightly out to the side this allows me to launch the next Club boom yeah so just let the arm stretch out and return to order so every time side to side and following the club with my eyes and my head I stay nice and relaxed use the breathing to to help the timing as well so very simple the alternating low cast or alternating Front Circle again one name is what it's called in a system and then in another system they call it something different but basically it's a circle based around our elbow right now if you can go in and cross the midline at the start you can also do the opposite where you're going to turn this time look at the club situated to your back so this one is front this one's at the back and now let's swing boom from out to in and there we go so now we're doing the outer alternated circles right of course you can experiment also with the parallel variations [Music] but the next one we need to focus on is the um back circles and when we mentioned back Circles of course it's a circle happening behind the back but it's a high Circle otherwise it would be called Low back Circle right so from the older position we're going to bring the club up as if we're blocking a Blow To The Head the end of the club is going to point directly at the opposite shoulder and now you can see my elbow is about 90 degrees bent I'm going to close that Gap so the club slides and falls at the same time or drops and as soon as it goes over my shoulder I pull it back down into the odor yeah so here boom nice and slow control now the movement is happening around the elbow the only thing your wrist is doing is a slight deviation like this yeah we're not trying to use the wrist to do this swing now what is important is to relax so you can do that by relaxing your grip you see that basically my little finger is choking onto the knob here and providing enough grip that don't have to squeeze the rest of my hand so yes I'm still holding the club with all the digits but it's a very nice and loose grip as soon as the club is in motion swinging behind my back look at the end of the club over the opposite shoulder bend the elbow and pull down to order so we have basically a push a relax a Twist and Turn and pull yeah you see my body is not centered I'm facing a little bit to the side I push twist and pull push twist and Pull and the trick is finding the Rhythm the timing when I'm supposed to do the different actions the more I can relax the smoother my swing will be if you still have problems feeling the swing behind your back you can experiment with a slightly heavier club or you can use the physics and the gravity to your advantage so from the old position we're going to press the club directly up into What's called the torch position yeah boom from here I'm going to Simply maintain my elbow pointing up and bend it so the club's going to fall behind me and pull now that extra drop accentuate the forces and might help you to understand the swing a little bit better yeah next up is the last of the three pivot Points we're going to look at wrist circles this can be a little bit challenging so we're going to introduce a a prop to help you learn the swing a lot faster so let's look at the wrist circles from the older position boom and then you can start adding or linking the swings but remember when you're learning a new movement the best is just do one repetition Mark a short break and then link the next one okay so these are forward circles from the old position and then of course we have the reverse Boom the club starts Falling Towards my shoulder and return to order so once you know the forward and backwards you probably guessed it you can also do opposite wrist circles okay so these are the possibilities that you have in this plane of motion once you've learned and we're going to go to the tutorial and the enhanced tutorial so you're going to learn it faster once you learn the those three circles you also want to practice them from the flag position with the arms out to the side so you can have the away from the body outer circles towards the body inner circles okay so it's a good idea to be able to do those circles in any type of position because then you can start adding them at different uh section of your swings so combining the wrist circles with the larger Circle and so on and we'll look at a few examples after the tutorial okay guys using a wall is the fastest way to learn the wrist circles gives you instant feedback and adjusts the trajectory of your swing so what you do is you step close to the wall should be roughly like a hence width apart between your shoulder and the wall you come to your order position let the club rest against the wall yeah from there the club's going to drop forward your pound is gonna face up to the ceiling and you can release the three digits the last three digits so you're holding on to the club with the ring grip okay now the club is pointing down this time you can see my elbow has moved in towards my Center Line yeah the Palm is facing fully up the club has not dropped in my hand I'm still holding on to the same position as I had a full grip so avoid letting the club drop so you're only uh only holding on to the knob yeah so here I am and from here I'm going to use the acceleration to bring the club back to order and observe now the position of my hand low launch it's climbing it's coming up and as I pull down to order it drops so try um thinking it's like a full body exercise that just holding the wrist in place and trying to those circles especially important if using heavier clubs then of course we've got the reverse boom as always when you're learning one rep at a Time Boom Mark the order and then you can start linking remember don't let go of that ring grip so once you've worked with the circles and you start to develop some kind of feeling for the pool of gravity and the flow timing and so on you can experiment and try to add wrist circles to other type of circles so remember that the direction of both circles have to match so for example if I'm doing an inner inner shoulder Circle yeah if I had a wrist circle of course has to be a wrist Circle towards the body as well so I can just carry on from the one into the next and the same is true here going out this way or yeah so it's going to be a work of self-discovery I hope you enjoy adding the little new dimension of wrist circles to you of the circles",
      "rawContent": "![Thumbnail (1920x1080)](https://i.ytimg.com/vi/Wh4T4o3q7z8/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgZShlMA8=&rs=AOn4CLBBLk63jwhWFaQsIXqbShpKxncZpQ)\n# [Indian clubs 101 Lesson 3/5:  Basic circles | Free YouTube course for beginners](https://www.youtube.com/watch?v=Wh4T4o3q7z8)\n\n**Visibility**: Public\n**Uploaded by**: [Heroic Sport - Indian clubs workouts](http://www.youtube.com/@HeroicSport)\n**Uploaded at**: 2023-03-14T05:18:28-07:00\n**Published at**: 2023-03-14T05:18:28-07:00\n**Length**: 21:13\n**Views**: 3093\n**Likes**: 94\n**Category**: Sports\n\n## Description\n\n```\nCircles with India clubs can be done around 3 pivot points: shoulder, elbow, wrist.\nYou can perform them in all planes: by the sides, in front of the body, behind the body, diagonally across the body or horizontally across the body.\nAnd finally, if you can do a circle in one direction, you can reverse that direction. \nWith 2 clubs, this allows you to eventually dissociate left from right arm, performing intricate patterns at different tempos.\n\n0:05 Inner circles \n0:50 Outer circles  \n1:40 Parallel circles \n3:30 Front crawl \n4:12 Back crawl  \n4:45 Opposite circles by the sides\n6:45 Figure 8 \n8:15 Reverse 8 \n9:18 Combination exercise \n11:18 Alternating low cast  \n13:22 Alternating back circles \n16:30 Wrist circles \n20:15 Combining wrist circles \n\n---\nWhat can Indian clubs do for you?\nWatch this: https://www.youtube.com/watch?v=ft-FL_6s_No\n\n❂ Physical benefits\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\nConsists of compound movements in multiple planes\nProvides low impact cardiovascular exercise\nAssists recovery from intense training\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n\n❂ Mental benefits\nIt is fun and you forget you are training.\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ Heroic Sport | An ancient discipline \nWe have created the Pahlavandle ™ range to make it affordable for everyone to discover the benefits of swinging clubs.\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors and wrestlers. \nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n```\n\n## Transcript\n\nforeign [Music] Circle so we're going to bring the clubs up above our head and we're going to cross the midline straight away and return to the top position now when I reach there I want to alternate my Crossing hands just like we did with the pendulums yeah so work on one rep at a time and when that feels good then you can start having a bit more slow yeah so any type of movement where we cross the midline is defined as a closing movement or an inner type of circle when we're doing the Outer Circle we're going to let our arms fall out to the side and return to the start position so from here I'm just gonna keep the clubs in Pro against my arm cross at the bottom and return to the start just like we did before every time my hands are crossing and changing the leading hand of the top hand if you want again do a few reps of those nice and slow one rep at a time and then when comfortable you flow smoothly from one swing to the next no sudden acceleration strive to maintain a steady reliable casual tempo so if we have a parallel to One Direction of course we have the opposite as well so we've got parallel to the left parallel to the right so here I start at the top again to make it easy during the learning process and I'm going to slightly turn so the clubs are going to be really tight and closed against my body just like if there was a wall in front of me and they're both moving at the same speed so I turn slightly I start to drop I turn and I square up my body as I finish and again when you start feeling the flow of the move then you link the terms again no sudden acceleration keep it nice and smooth and flowy yeah boom now if you have troubles and you feel your arms are about to cross so you don't know exactly what's happening what you can do is just hold on to one club like this so you're going to start here everything is squared up turn to the one side bring the clubs in front of you and lift them up and return to the start yeah so we drop Square lift and then of course practice in both directions so every time that my arms are up or down yeah my body is squared up so there's no Crossing no tangling of the arms after view practice the circles in front of the body we're going to start practicing the circles by the side of the body now it's impossible to move both arms in the same direction at the same time without dislocating the shoulders so here we're going to work on a bit more complex movement we're going to add an element of a rhythm so the first is going to be alternating forward circles yeah so it's like doing the front crawl in the pool boom I can use my leg drive again boom I'm done finish [Music] return to order and then we're going to practice the reverse so I'm going to show different you this time but it's still the same principle one Club starts moving backwards it reaches the bottom position the next one starts yes I'm doing my back crawl [Music] next up we've got the opposite circles so one club is going to move forward and the other one is going to move backwards and this is really emphasizing the rotation through the upper body it's the only way you can do this properly without hurting your shoulders so let's have a look at it in slo-mo boom my body is squared up one Club Falls forward the other one backwards I look at the back Club here I am in the T sort of like both clubs are in line I square up again as my clubs are by the side of the leg I turn to the other side look at my back Club and then I come back and score out my body when they're both overhead so with a bit of speed and you guessed it two directions so now we're going to switch the right hand is going to move forward left is going to go back now what's important when I'm doing those circles by the side of the body is make sure that I stay in the right plane of motion right pain so you go to picture yourself inside a very narrow Corridor where you're basically scraping the walls yeah so there's a difference when I'm doing my back Circle going out wide I'm describing a small circle compared to here really tight against the legs and I'm describing the biggest circle that I can so this is what I want to achieve on every rep the biggest circle around the using the joint that we're supposed to to use so shoulder elbow or wrist doesn't matter same principle applies [Music] okay the next big circles we're going to look at are actually going to take place on the diagonal line so we're going to cross the midline and perform figure eights so it's going to be a tall figure eight instead of a flat cigarette let's look at it order you're going to Simply cross to the one side look at the club you come to the top there and you're going to swing both arms to the other side so we've got a side to side swing nice tight close against my legs so I want to stand with my feet right under my hips so I'm not swinging out wide or hitting my knees yeah let's take a look at the side view so here boom I start and moving forward my Knuckles are driving the movement imagine you're chopping somebody in two halves yeah so the edge of your sword has to be pointing downwards boom [Music] so for the reverse eight we're going to bring one club to order turn and look over that shoulder let both clubs describe a circle by the side of the body and then switch across there's a bit of side bending element in this exercise we are coiling the core harnessing all the power from our midsection to drive the clubs notice I'm still pivoting with my feet as well yeah side view look back boom so this time the knuckles are facing up to the ceiling as we drive the sword from the ground up to the ceiling boom so here's a quick little combination that you can do where you're going to introduce again the element of stepping and turning 90 degrees so just like we did with the pendulums where we start with the Crossing in front of the body and turning to the side into the opposite pendulum we're going to repeat the same sequence but this time we're going to do full circles so we're going to start with the inner and you could also try it with the outer circles and then we're going to turn and it's going to change into the opposite circles where we're going to end up swinging by the side of the body so let's take a look and practice a few times all right so from order I bring the clubs up I start with my first Circle second third and the fourth and without stopping I got one two three and four come back to the center one two three and four to the other side one two three and four back to Center one two three four out of the circle one two three four and turn one two three four back to Center one two three four turn one two three four and back to the center where we close okay so there's a bit of work there for you guys and girls mastering the timing when is it exactly that I have to turn so that do not interrupt the smoothness of the swings and therefore the flow [Music] so now we're going to look at the elbow circles elbow circles are involved when we're doing the heart-shaped swings so this is going to basic and short introduction that will help you build the foundations to learn and progress to the different type of r-shaped swings so the first one we're going to do is from the order position do a front elbow Circle so the clubs is going to swing from order and return to order and you can see when I catch that order I'm not centered but I'm slightly out to the side this allows me to launch the next Club boom yeah so just let the arm stretch out and return to order so every time side to side and following the club with my eyes and my head I stay nice and relaxed use the breathing to to help the timing as well so very simple the alternating low cast or alternating Front Circle again one name is what it's called in a system and then in another system they call it something different but basically it's a circle based around our elbow right now if you can go in and cross the midline at the start you can also do the opposite where you're going to turn this time look at the club situated to your back so this one is front this one's at the back and now let's swing boom from out to in and there we go so now we're doing the outer alternated circles right of course you can experiment also with the parallel variations [Music] but the next one we need to focus on is the um back circles and when we mentioned back Circles of course it's a circle happening behind the back but it's a high Circle otherwise it would be called Low back Circle right so from the older position we're going to bring the club up as if we're blocking a Blow To The Head the end of the club is going to point directly at the opposite shoulder and now you can see my elbow is about 90 degrees bent I'm going to close that Gap so the club slides and falls at the same time or drops and as soon as it goes over my shoulder I pull it back down into the odor yeah so here boom nice and slow control now the movement is happening around the elbow the only thing your wrist is doing is a slight deviation like this yeah we're not trying to use the wrist to do this swing now what is important is to relax so you can do that by relaxing your grip you see that basically my little finger is choking onto the knob here and providing enough grip that don't have to squeeze the rest of my hand so yes I'm still holding the club with all the digits but it's a very nice and loose grip as soon as the club is in motion swinging behind my back look at the end of the club over the opposite shoulder bend the elbow and pull down to order so we have basically a push a relax a Twist and Turn and pull yeah you see my body is not centered I'm facing a little bit to the side I push twist and pull push twist and Pull and the trick is finding the Rhythm the timing when I'm supposed to do the different actions the more I can relax the smoother my swing will be if you still have problems feeling the swing behind your back you can experiment with a slightly heavier club or you can use the physics and the gravity to your advantage so from the old position we're going to press the club directly up into What's called the torch position yeah boom from here I'm going to Simply maintain my elbow pointing up and bend it so the club's going to fall behind me and pull now that extra drop accentuate the forces and might help you to understand the swing a little bit better yeah next up is the last of the three pivot Points we're going to look at wrist circles this can be a little bit challenging so we're going to introduce a a prop to help you learn the swing a lot faster so let's look at the wrist circles from the older position boom and then you can start adding or linking the swings but remember when you're learning a new movement the best is just do one repetition Mark a short break and then link the next one okay so these are forward circles from the old position and then of course we have the reverse Boom the club starts Falling Towards my shoulder and return to order so once you know the forward and backwards you probably guessed it you can also do opposite wrist circles okay so these are the possibilities that you have in this plane of motion once you've learned and we're going to go to the tutorial and the enhanced tutorial so you're going to learn it faster once you learn the those three circles you also want to practice them from the flag position with the arms out to the side so you can have the away from the body outer circles towards the body inner circles okay so it's a good idea to be able to do those circles in any type of position because then you can start adding them at different uh section of your swings so combining the wrist circles with the larger Circle and so on and we'll look at a few examples after the tutorial okay guys using a wall is the fastest way to learn the wrist circles gives you instant feedback and adjusts the trajectory of your swing so what you do is you step close to the wall should be roughly like a hence width apart between your shoulder and the wall you come to your order position let the club rest against the wall yeah from there the club's going to drop forward your pound is gonna face up to the ceiling and you can release the three digits the last three digits so you're holding on to the club with the ring grip okay now the club is pointing down this time you can see my elbow has moved in towards my Center Line yeah the Palm is facing fully up the club has not dropped in my hand I'm still holding on to the same position as I had a full grip so avoid letting the club drop so you're only uh only holding on to the knob yeah so here I am and from here I'm going to use the acceleration to bring the club back to order and observe now the position of my hand low launch it's climbing it's coming up and as I pull down to order it drops so try um thinking it's like a full body exercise that just holding the wrist in place and trying to those circles especially important if using heavier clubs then of course we've got the reverse boom as always when you're learning one rep at a Time Boom Mark the order and then you can start linking remember don't let go of that ring grip so once you've worked with the circles and you start to develop some kind of feeling for the pool of gravity and the flow timing and so on you can experiment and try to add wrist circles to other type of circles so remember that the direction of both circles have to match so for example if I'm doing an inner inner shoulder Circle yeah if I had a wrist circle of course has to be a wrist Circle towards the body as well so I can just carry on from the one into the next and the same is true here going out this way or yeah so it's going to be a work of self-discovery I hope you enjoy adding the little new dimension of wrist circles to you of the circles\n\n\n",
      "transcriptLines": 16,
      "wordCount": 2941,
      "metadata": {
        "og:video:type": "text/html",
        "position": "1",
        "og:image:width": "1280",
        "og:video:width": "1280",
        "twitter:app:name:iphone": "YouTube",
        "al:android:app_name": "YouTube",
        "og:video:tag": [
          "clubbell",
          "Pahlavandle",
          "Heroic Sport",
          "Thierry Sanchez",
          "Indian Clubs",
          "Club Swinging Exercises",
          "Shoulder Health",
          "Indian club exercises",
          "Karla Kattai",
          "Mugdal",
          "Karlakattai",
          "karala kattai",
          "circular strength training",
          "indian club exercises for beginners",
          "beginner exercise",
          "hema",
          "sword fighting",
          "mugdar",
          "mudgar",
          "historical european martial arts",
          "dryland training",
          "indian clubs workout",
          "mudgar workout",
          "loaded mobility",
          "physical culture",
          "heavy club exercises"
        ],
        "playerType": "HTML5 Flash",
        "favicon": "https://www.youtube.com/s/desktop/06be7d2e/img/favicon_32x32.png",
        "twitter:app:url:iphone": "vnd.youtube://www.youtube.com/watch?v=Wh4T4o3q7z8&feature=applinks",
        "isFamilyFriendly": "true",
        "al:android:package": "com.google.android.youtube",
        "name": [
          "Indian clubs 101 Lesson 3/5:  Basic circles | Free YouTube course for beginners",
          "Heroic Sport - Indian clubs workouts"
        ],
        "requiresSubscription": "False",
        "twitter:app:name:ipad": "YouTube",
        "fb:app_id": "87741124305",
        "interactionType": [
          "https://schema.org/LikeAction",
          "https://schema.org/WatchAction"
        ],
        "og:video:height": "720",
        "og:site_name": "YouTube",
        "og:type": "video.other",
        "regionsAllowed": "AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW",
        "theme-color": "rgba(255, 255, 255, 0.98)",
        "og:image:height": "720",
        "twitter:app:id:googleplay": "com.google.android.youtube",
        "duration": "PT21M13S",
        "height": [
          "720",
          "720"
        ],
        "al:ios:url": "vnd.youtube://www.youtube.com/watch?v=Wh4T4o3q7z8&feature=applinks",
        "twitter:url": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
        "og:image": "https://i.ytimg.com/vi/Wh4T4o3q7z8/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgZShlMA8=&rs=AOn4CLBBLk63jwhWFaQsIXqbShpKxncZpQ",
        "twitter:player": "https://www.youtube.com/embed/Wh4T4o3q7z8",
        "viewport": [
          "width=device-width, initial-scale=1.0, viewport-fit=cover",
          "initial-scale=1, minimum-scale=1, width=device-width"
        ],
        "al:android:url": "vnd.youtube://www.youtube.com/watch?v=Wh4T4o3q7z8&feature=applinks",
        "title": "Indian clubs 101 Lesson 3/5:  Basic circles | Free YouTube course for beginners - YouTube",
        "datePublished": "2023-03-14T05:18:28-07:00",
        "al:ios:app_name": "YouTube",
        "referrer": "origin-when-cross-origin",
        "twitter:player:height": "720",
        "twitter:card": "player",
        "twitter:title": "Indian clubs 101 Lesson 3/5:  Basic circles | Free YouTube course for beginners",
        "genre": "Sports",
        "twitter:image": "https://i.ytimg.com/vi/Wh4T4o3q7z8/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgZShlMA8=&rs=AOn4CLBBLk63jwhWFaQsIXqbShpKxncZpQ",
        "twitter:description": "Circles with India clubs can be done around 3 pivot points: shoulder, elbow, wrist.You can perform them in all planes: by the sides, in front of the body, be...",
        "og:title": "Indian clubs 101 Lesson 3/5:  Basic circles | Free YouTube course for beginners",
        "twitter:player:width": "1280",
        "ogImage": "https://i.ytimg.com/vi/Wh4T4o3q7z8/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgZShlMA8=&rs=AOn4CLBBLk63jwhWFaQsIXqbShpKxncZpQ",
        "og:url": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
        "language": "en",
        "og:video:secure_url": "https://www.youtube.com/embed/Wh4T4o3q7z8",
        "twitter:app:name:googleplay": "YouTube",
        "ogDescription": "Circles with India clubs can be done around 3 pivot points: shoulder, elbow, wrist.You can perform them in all planes: by the sides, in front of the body, be...",
        "ogUrl": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
        "og:video:url": "https://www.youtube.com/embed/Wh4T4o3q7z8",
        "ogSiteName": "YouTube",
        "og:description": "Circles with India clubs can be done around 3 pivot points: shoulder, elbow, wrist.You can perform them in all planes: by the sides, in front of the body, be...",
        "twitter:app:url:ipad": "vnd.youtube://www.youtube.com/watch?v=Wh4T4o3q7z8&feature=applinks",
        "twitter:site": "@youtube",
        "identifier": "Wh4T4o3q7z8",
        "userInteractionCount": [
          "94",
          "3093"
        ],
        "twitter:app:id:iphone": "544007664",
        "description": "Circles with India clubs can be done around 3 pivot points: shoulder, elbow, wrist.You can perform them in all planes: by the sides, in front of the body, be..., Circles with India clubs can be done around 3 pivot points: shoulder, elbow, wrist.You can perform them in all planes: by the sides, in front of the body, be...",
        "keywords": [
          "clubbell, Pahlavandle, Heroic Sport, Thierry Sanchez, Indian Clubs, Club Swinging Exercises, Shoulder Health, Indian club exercises, Karla Kattai, Mugdal, Karlakattai, karala kattai, circular strength training, indian club exercises for beginners, beginner exercise, hema, sword fighting, mugdar, mudgar, historical european martial arts, dryland training, indian clubs workout, mudgar workout, loaded mobility, physical culture, heavy club exercises",
          "clubbell,Pahlavandle,Heroic Sport,Thierry Sanchez,Indian Clubs,Club Swinging Exercises,Shoulder Health,Indian club exercises,Karla Kattai,Mugdal,Karlakattai,karala kattai,circular strength training,indian club exercises for beginners,beginner exercise,hema,sword fighting,mugdar,mudgar,historical european martial arts,dryland training,indian clubs workout,mudgar workout,loaded mobility,physical culture,heavy club exercises"
        ],
        "twitter:app:id:ipad": "544007664",
        "ogTitle": "Indian clubs 101 Lesson 3/5:  Basic circles | Free YouTube course for beginners",
        "twitter:app:url:googleplay": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
        "width": [
          "1280",
          "1280"
        ],
        "al:ios:app_store_id": "544007664",
        "al:web:url": "http://www.youtube.com/watch?v=Wh4T4o3q7z8&feature=applinks",
        "uploadDate": "2023-03-14T05:18:28-07:00",
        "scrapeId": "d7460898-6ab1-466e-b61c-d0d6465af264",
        "sourceURL": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
        "url": "https://www.youtube.com/watch?v=Wh4T4o3q7z8",
        "statusCode": 200,
        "contentType": "text/html; charset=utf-8",
        "proxyUsed": "basic",
        "postprocessorsUsed": [
          "youtube"
        ],
        "creditsUsed": 1
      },
      "extractedAt": "2025-09-23T21:50:53.308Z"
    },
    {
      "url": "https://www.youtube.com/watch?v=NWLobCcLoMo",
      "originalTitle": "Series 101 Video",
      "originalDescription": "",
      "videoId": "NWLobCcLoMo",
      "series": "101",
      "processingIndex": 15,
      "totalVideos": 141,
      "batchNumber": 4,
      "processedAt": "2025-09-23T21:51:13.049Z",
      "foundVia": "Channel search for 101",
      "transcriptSuccess": true,
      "extractionError": null,
      "success": true,
      "videoUrl": "https://www.youtube.com/watch?v=NWLobCcLoMo",
      "transcriptText": "What can Indian clubs do for you?\n\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\n\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\n\nConsists of compound movements in multiple planes\n\nProvides low impact cardiovascular exercise\n\nAssists recovery from intense training\n\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n\nIt is fun and you forget you are training.\n\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\n\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ Heroic Sport | An ancient discipline\n\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors and wrestlers.\n\nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n\nforeign so let's start with the basic swings and the pendulums so we're going to do a basic Pendulum by the side of the body when you swing by the side of the body I want to I want you to have your feet right under your hips so you're not going to hit your knees and the clubs are not going to fly out wide so the old position is here the clubs are vertical pointing to the ceiling from here you're simply going to let the clubs drop come into the prolongation of your arms and you're going to swing back and forth very simple so right now we're just swinging with the shoulders as the main Pivot Point now we're going to add a bit of hip movement so on the back swing I'm going to sit down and straighten up as the clubs come forward and return to order so the side view where conservative details when I sit back I bend at the knees and the hips while maintaining a Long Tall spine so from order the club swelling prongation of my arms that's the first thing and then I go straight into my swing foreign yes so practice that a little bit until you get the feel and remember at any times during this course you can pose take a break [Music] the second basic swing is based on the first one but this time the arms and the clubs are going to move in alternate fashion so one club is going to go forward while the other one is going back and I'm using a little bit of up and down movement known as leg drive to assist the swing now I'm going to turn and look towards my back Club on each rep I'm introducing an element of balance and engaging the whole vestibular system into this swing yeah so the side view from the auto position one Club starts and then here we are remember it's nice and gentle Tempo no rushing it it should feel rhythmic and smooth [Music] the next swing we're going to look at is called the swipe it's actually a prolongation of the pendulum where we have a definite end point to the swing we're going to catch the clubs over our shoulders on our back right so the first thing is the arm cast from the old position we're simply going to lift the elbows up so they point up to the ceiling and the clubs at the end of the club is pointing down towards the ground from here I'm going to engage my midsection so I've got a nice straight long spine pull the club back into order and so I just lift push pull push pull remember that you still want to have relaxed knees at the same time right so we're going to use the breathing as well so that's the arm cast now we're going to combine the swing by the side of the body and the arm cast to create the swipe so it looks like this from the other position push pull Club in the propagation of your arm back swing catch push pull and so on now the goal of the exercise is to make that transition between the two swings as smooth as possible so right now as you're learning we'll mark a little definite pose boom pose and so on and then the clubs are going to basically roll over your shoulders boom that was the swipe now like all the swings that we're going to show you you can always add some type of footwork combining the lower body and the upper body so here we're going to take our basic swipe and combine it with a front lunge so we start with the back swing as I come to the old position I'm going to step into that front lunge and catch the clubs in my bottom position of the lunge I pull as I stand up my feet come together on the same line I go into my back swing and then I switch yeah and when we have the flu so it becomes a more dynamic but still very rhythmic element yes [Music] we've been swinging by the side of the body this time we're going to do by the front of the body so we're going to start with a very basic pendulum again it's going to be a parallel pendulum so both arms are going to move in the same direction at the same speed this time when I'm swinging from side to side I'm gonna use a bit more floor space by standing wider so I've got stability from side to side no need to go bananas shoulder or round shoulder a little bit over it's all good so from the older position I'm going to set the clubs drop and swing to about shoulder height I'm still using that leg drive you can see my knees up and down moving the other thing you notice is that looking at the club's side to side so that's our basic pendulum in front of the body when I'm done I return to order [Music] another type of basic pendulum that will really help you when we are starting to play with circles and the heart-shaped swings is the crossing pendulum so this time from the old position we're going to cross the arms and the clubs let them swing out to shoulder height and return to order so you're basically learning how to cross and then cross without hitting the clubs now you can also do this exercise without coming to order so you just simply Crossing the arms remember to turn the thumbs up when they're clubs at Shoal level and wait until the last minute when they're almost brushing past the leg to turn clubs and have them cross right now a little detail is going to have you focus on which arm is Crossing so for example right now it's my right arm Crossing on top and then my left arm and then I go back to the right arm so every rep I alternate The Crossing hands so I've got balance in my training so already with the basic pendulums you can start combining swings and footwork to create interesting combinations and small flows so let's look at the first one just based on the crossing pendulum now we can decide to stop in this High position overhead or just to the flag position up to you yeah so the first stepping we're going to do is doing to do a basic front lunge and we're going to switch the legs on each repetition then we're going to look at the dragon lunge the dragon lunge you cross over and drop again to the depth that feels comfortable for you like this and then the last is going to be a simple step out to the side and sit back into a squat I'm going to step forward left and catch return to order boom right and catch now the dragon lunge a little tricky one oh the overhead squat watch that now wearing tight pants because they might split or they need to be reinforced at the stitching anyway play with this concept and you can see how putting simple movements become a lot more challenging that year involving your lower body this short combination is going to let you experience how small steps can actually dramatically change the shape of your swing and maybe also the timing so we're going to start with a Crossing pendulum in front of the body okay so both arms are moving in the same direction towards the midline and then we're going to step out 90 degrees and now the clubs are going to swing by the side of our body in alternate fashion so let's have a look we go here is our first Crossing one two three four I turn to the left one two three four come back to the center one two three four to the right one two three four back to the center one two three four and so on one two three four one two three four one two three four and we close yeah so just work on a nice relaxed floor you can see it's very rhythmic very soothing for your body and you start to create new neural adaptations just by involving that stepping coordinating um the lower body the upper body and the different type of swings that results of you turning [Music]",
      "rawContent": "![Thumbnail (1920x1080)](https://i.ytimg.com/vi/NWLobCcLoMo/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGIgYihiMA8=&rs=AOn4CLAW0gFPpHpvYClwh0GDhRgbzI_M8Q)\n# [Indian clubs 101 Lesson 2/5:  Basic pendulums | Free YouTube course for beginners](https://www.youtube.com/watch?v=NWLobCcLoMo)\n\n**Visibility**: Public\n**Uploaded by**: [Heroic Sport - Indian clubs workouts](http://www.youtube.com/@HeroicSport)\n**Uploaded at**: 2023-03-14T05:06:00-07:00\n**Published at**: 2023-03-14T05:06:00-07:00\n**Length**: 11:40\n**Views**: 4704\n**Likes**: 123\n**Category**: Sports\n\n## Description\n\n```\n0:05 Pendulums by the side of the body\n1:27 Alternating pendulums by the sides \n2:37 Swipe \n4:38 Swipe with lunge \n5:41 Pendulums in front of the body\n6:45 Crossing pendulums \n8:10 Simple flow #1  \n10:00 Simple flow #2\n---\nWhat can Indian clubs do for you?\nWatch this: https://www.youtube.com/watch?v=ft-FL_6s_No\n\n❂ Physical benefits\nGently mobilizes the shoulders, elbows and wrists and improve range of motion\nStrengthens the shoulder girdle and grip ( muscles and connective tissues) in its full range of motion\nConsists of compound movements in multiple planes\nProvides low impact cardiovascular exercise\nAssists recovery from intense training\nImproves the 3 pillars of physical literacy (body control , locomotion and object control)\n\n❂ Mental benefits\nIt is fun and you forget you are training.\nThe rhythmic and repetitive patterns are highly meditative and calm the nervous system, like meditation.\nCross crawl exercises and other challenging moves improve learning capacity and stimulate neurogenesis, the creation of new brain cells.\n\n❂ Heroic Sport | An ancient discipline \nWe have created the Pahlavandle ™ range to make it affordable for everyone to discover the benefits of swinging clubs.\nOur clubs are easily adjustable, which is a modern twist on the ancient traditional Indian clubs used to train Tamil and Persian warriors and wrestlers. \nIndian clubs were used in Europe and USA for remedial gymnastics in the 18th and 19th century, by pioneers of physiotherapy.\n```\n\n## Transcript\n\nforeign so let's start with the basic swings and the pendulums so we're going to do a basic Pendulum by the side of the body when you swing by the side of the body I want to I want you to have your feet right under your hips so you're not going to hit your knees and the clubs are not going to fly out wide so the old position is here the clubs are vertical pointing to the ceiling from here you're simply going to let the clubs drop come into the prolongation of your arms and you're going to swing back and forth very simple so right now we're just swinging with the shoulders as the main Pivot Point now we're going to add a bit of hip movement so on the back swing I'm going to sit down and straighten up as the clubs come forward and return to order so the side view where conservative details when I sit back I bend at the knees and the hips while maintaining a Long Tall spine so from order the club swelling prongation of my arms that's the first thing and then I go straight into my swing foreign yes so practice that a little bit until you get the feel and remember at any times during this course you can pose take a break [Music] the second basic swing is based on the first one but this time the arms and the clubs are going to move in alternate fashion so one club is going to go forward while the other one is going back and I'm using a little bit of up and down movement known as leg drive to assist the swing now I'm going to turn and look towards my back Club on each rep I'm introducing an element of balance and engaging the whole vestibular system into this swing yeah so the side view from the auto position one Club starts and then here we are remember it's nice and gentle Tempo no rushing it it should feel rhythmic and smooth [Music] the next swing we're going to look at is called the swipe it's actually a prolongation of the pendulum where we have a definite end point to the swing we're going to catch the clubs over our shoulders on our back right so the first thing is the arm cast from the old position we're simply going to lift the elbows up so they point up to the ceiling and the clubs at the end of the club is pointing down towards the ground from here I'm going to engage my midsection so I've got a nice straight long spine pull the club back into order and so I just lift push pull push pull remember that you still want to have relaxed knees at the same time right so we're going to use the breathing as well so that's the arm cast now we're going to combine the swing by the side of the body and the arm cast to create the swipe so it looks like this from the other position push pull Club in the propagation of your arm back swing catch push pull and so on now the goal of the exercise is to make that transition between the two swings as smooth as possible so right now as you're learning we'll mark a little definite pose boom pose and so on and then the clubs are going to basically roll over your shoulders boom that was the swipe now like all the swings that we're going to show you you can always add some type of footwork combining the lower body and the upper body so here we're going to take our basic swipe and combine it with a front lunge so we start with the back swing as I come to the old position I'm going to step into that front lunge and catch the clubs in my bottom position of the lunge I pull as I stand up my feet come together on the same line I go into my back swing and then I switch yeah and when we have the flu so it becomes a more dynamic but still very rhythmic element yes [Music] we've been swinging by the side of the body this time we're going to do by the front of the body so we're going to start with a very basic pendulum again it's going to be a parallel pendulum so both arms are going to move in the same direction at the same speed this time when I'm swinging from side to side I'm gonna use a bit more floor space by standing wider so I've got stability from side to side no need to go bananas shoulder or round shoulder a little bit over it's all good so from the older position I'm going to set the clubs drop and swing to about shoulder height I'm still using that leg drive you can see my knees up and down moving the other thing you notice is that looking at the club's side to side so that's our basic pendulum in front of the body when I'm done I return to order [Music] another type of basic pendulum that will really help you when we are starting to play with circles and the heart-shaped swings is the crossing pendulum so this time from the old position we're going to cross the arms and the clubs let them swing out to shoulder height and return to order so you're basically learning how to cross and then cross without hitting the clubs now you can also do this exercise without coming to order so you just simply Crossing the arms remember to turn the thumbs up when they're clubs at Shoal level and wait until the last minute when they're almost brushing past the leg to turn clubs and have them cross right now a little detail is going to have you focus on which arm is Crossing so for example right now it's my right arm Crossing on top and then my left arm and then I go back to the right arm so every rep I alternate The Crossing hands so I've got balance in my training so already with the basic pendulums you can start combining swings and footwork to create interesting combinations and small flows so let's look at the first one just based on the crossing pendulum now we can decide to stop in this High position overhead or just to the flag position up to you yeah so the first stepping we're going to do is doing to do a basic front lunge and we're going to switch the legs on each repetition then we're going to look at the dragon lunge the dragon lunge you cross over and drop again to the depth that feels comfortable for you like this and then the last is going to be a simple step out to the side and sit back into a squat I'm going to step forward left and catch return to order boom right and catch now the dragon lunge a little tricky one oh the overhead squat watch that now wearing tight pants because they might split or they need to be reinforced at the stitching anyway play with this concept and you can see how putting simple movements become a lot more challenging that year involving your lower body this short combination is going to let you experience how small steps can actually dramatically change the shape of your swing and maybe also the timing so we're going to start with a Crossing pendulum in front of the body okay so both arms are moving in the same direction towards the midline and then we're going to step out 90 degrees and now the clubs are going to swing by the side of our body in alternate fashion so let's have a look we go here is our first Crossing one two three four I turn to the left one two three four come back to the center one two three four to the right one two three four back to the center one two three four and so on one two three four one two three four one two three four and we close yeah so just work on a nice relaxed floor you can see it's very rhythmic very soothing for your body and you start to create new neural adaptations just by involving that stepping coordinating um the lower body the upper body and the different type of swings that results of you turning [Music]\n\n\n",
      "transcriptLines": 14,
      "wordCount": 1610,
      "metadata": {
        "og:type": "video.other",
        "og:video:tag": [
          "clubbell",
          "Pahlavandle",
          "Heroic Sport",
          "Thierry Sanchez",
          "Indian Clubs",
          "Club Swinging Exercises",
          "Shoulder Health",
          "Indian club exercises",
          "Karla Kattai",
          "Mugdal",
          "Karlakattai",
          "karala kattai",
          "circular strength training",
          "indian club exercises for beginners",
          "beginner exercise",
          "hema",
          "sword fighting",
          "mugdar",
          "mudgar",
          "historical european martial arts",
          "dryland training",
          "indian clubs workout",
          "mudgar workout",
          "loaded mobility",
          "physical culture",
          "heavy club exercises"
        ],
        "identifier": "NWLobCcLoMo",
        "twitter:app:name:googleplay": "YouTube",
        "ogSiteName": "YouTube",
        "userInteractionCount": [
          "123",
          "4704"
        ],
        "og:video:height": "720",
        "al:ios:app_name": "YouTube",
        "al:android:app_name": "YouTube",
        "twitter:title": "Indian clubs 101 Lesson 2/5:  Basic pendulums | Free YouTube course for beginners",
        "uploadDate": "2023-03-14T05:06:00-07:00",
        "description": "0:05 Pendulums by the side of the body1:27 Alternating pendulums by the sides 2:37 Swipe 4:38 Swipe with lunge 5:41 Pendulums in front of the body6:45 Crossi..., 0:05 Pendulums by the side of the body1:27 Alternating pendulums by the sides 2:37 Swipe 4:38 Swipe with lunge 5:41 Pendulums in front of the body6:45 Crossi...",
        "og:video:secure_url": "https://www.youtube.com/embed/NWLobCcLoMo",
        "og:video:width": "1280",
        "duration": "PT11M41S",
        "title": "Indian clubs 101 Lesson 2/5:  Basic pendulums | Free YouTube course for beginners - YouTube",
        "ogTitle": "Indian clubs 101 Lesson 2/5:  Basic pendulums | Free YouTube course for beginners",
        "og:site_name": "YouTube",
        "al:ios:url": "vnd.youtube://www.youtube.com/watch?v=NWLobCcLoMo&feature=applinks",
        "twitter:description": "0:05 Pendulums by the side of the body1:27 Alternating pendulums by the sides 2:37 Swipe 4:38 Swipe with lunge 5:41 Pendulums in front of the body6:45 Crossi...",
        "twitter:image": "https://i.ytimg.com/vi/NWLobCcLoMo/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGIgYihiMA8=&rs=AOn4CLAW0gFPpHpvYClwh0GDhRgbzI_M8Q",
        "og:url": "https://www.youtube.com/watch?v=NWLobCcLoMo",
        "interactionType": [
          "https://schema.org/LikeAction",
          "https://schema.org/WatchAction"
        ],
        "name": [
          "Indian clubs 101 Lesson 2/5:  Basic pendulums | Free YouTube course for beginners",
          "Heroic Sport - Indian clubs workouts"
        ],
        "twitter:app:name:ipad": "YouTube",
        "isFamilyFriendly": "true",
        "al:android:url": "vnd.youtube://www.youtube.com/watch?v=NWLobCcLoMo&feature=applinks",
        "al:android:package": "com.google.android.youtube",
        "twitter:app:name:iphone": "YouTube",
        "al:web:url": "http://www.youtube.com/watch?v=NWLobCcLoMo&feature=applinks",
        "twitter:player:height": "720",
        "twitter:player": "https://www.youtube.com/embed/NWLobCcLoMo",
        "twitter:app:id:iphone": "544007664",
        "width": [
          "1280",
          "1280"
        ],
        "og:description": "0:05 Pendulums by the side of the body1:27 Alternating pendulums by the sides 2:37 Swipe 4:38 Swipe with lunge 5:41 Pendulums in front of the body6:45 Crossi...",
        "requiresSubscription": "False",
        "ogDescription": "0:05 Pendulums by the side of the body1:27 Alternating pendulums by the sides 2:37 Swipe 4:38 Swipe with lunge 5:41 Pendulums in front of the body6:45 Crossi...",
        "og:image:height": "720",
        "position": "1",
        "ogUrl": "https://www.youtube.com/watch?v=NWLobCcLoMo",
        "twitter:player:width": "1280",
        "twitter:app:id:ipad": "544007664",
        "playerType": "HTML5 Flash",
        "og:video:url": "https://www.youtube.com/embed/NWLobCcLoMo",
        "twitter:card": "player",
        "viewport": [
          "width=device-width, initial-scale=1.0, viewport-fit=cover",
          "initial-scale=1, minimum-scale=1, width=device-width"
        ],
        "keywords": [
          "clubbell, Pahlavandle, Heroic Sport, Thierry Sanchez, Indian Clubs, Club Swinging Exercises, Shoulder Health, Indian club exercises, Karla Kattai, Mugdal, Karlakattai, karala kattai, circular strength training, indian club exercises for beginners, beginner exercise, hema, sword fighting, mugdar, mudgar, historical european martial arts, dryland training, indian clubs workout, mudgar workout, loaded mobility, physical culture, heavy club exercises",
          "clubbell,Pahlavandle,Heroic Sport,Thierry Sanchez,Indian Clubs,Club Swinging Exercises,Shoulder Health,Indian club exercises,Karla Kattai,Mugdal,Karlakattai,karala kattai,circular strength training,indian club exercises for beginners,beginner exercise,hema,sword fighting,mugdar,mudgar,historical european martial arts,dryland training,indian clubs workout,mudgar workout,loaded mobility,physical culture,heavy club exercises"
        ],
        "favicon": "https://www.youtube.com/s/desktop/06be7d2e/img/favicon_32x32.png",
        "twitter:app:url:iphone": "vnd.youtube://www.youtube.com/watch?v=NWLobCcLoMo&feature=applinks",
        "twitter:url": "https://www.youtube.com/watch?v=NWLobCcLoMo",
        "og:image:width": "1280",
        "og:image": "https://i.ytimg.com/vi/NWLobCcLoMo/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGIgYihiMA8=&rs=AOn4CLAW0gFPpHpvYClwh0GDhRgbzI_M8Q",
        "genre": "Sports",
        "height": [
          "720",
          "720"
        ],
        "twitter:app:url:ipad": "vnd.youtube://www.youtube.com/watch?v=NWLobCcLoMo&feature=applinks",
        "language": "en",
        "referrer": "origin-when-cross-origin",
        "fb:app_id": "87741124305",
        "twitter:app:url:googleplay": "https://www.youtube.com/watch?v=NWLobCcLoMo",
        "og:video:type": "text/html",
        "theme-color": "rgba(255, 255, 255, 0.98)",
        "og:title": "Indian clubs 101 Lesson 2/5:  Basic pendulums | Free YouTube course for beginners",
        "datePublished": "2023-03-14T05:06:00-07:00",
        "regionsAllowed": "AD,AE,AF,AG,AI,AL,AM,AO,AQ,AR,AS,AT,AU,AW,AX,AZ,BA,BB,BD,BE,BF,BG,BH,BI,BJ,BL,BM,BN,BO,BQ,BR,BS,BT,BV,BW,BY,BZ,CA,CC,CD,CF,CG,CH,CI,CK,CL,CM,CN,CO,CR,CU,CV,CW,CX,CY,CZ,DE,DJ,DK,DM,DO,DZ,EC,EE,EG,EH,ER,ES,ET,FI,FJ,FK,FM,FO,FR,GA,GB,GD,GE,GF,GG,GH,GI,GL,GM,GN,GP,GQ,GR,GS,GT,GU,GW,GY,HK,HM,HN,HR,HT,HU,ID,IE,IL,IM,IN,IO,IQ,IR,IS,IT,JE,JM,JO,JP,KE,KG,KH,KI,KM,KN,KP,KR,KW,KY,KZ,LA,LB,LC,LI,LK,LR,LS,LT,LU,LV,LY,MA,MC,MD,ME,MF,MG,MH,MK,ML,MM,MN,MO,MP,MQ,MR,MS,MT,MU,MV,MW,MX,MY,MZ,NA,NC,NE,NF,NG,NI,NL,NO,NP,NR,NU,NZ,OM,PA,PE,PF,PG,PH,PK,PL,PM,PN,PR,PS,PT,PW,PY,QA,RE,RO,RS,RU,RW,SA,SB,SC,SD,SE,SG,SH,SI,SJ,SK,SL,SM,SN,SO,SR,SS,ST,SV,SX,SY,SZ,TC,TD,TF,TG,TH,TJ,TK,TL,TM,TN,TO,TR,TT,TV,TW,TZ,UA,UG,UM,US,UY,UZ,VA,VC,VE,VG,VI,VN,VU,WF,WS,YE,YT,ZA,ZM,ZW",
        "ogImage": "https://i.ytimg.com/vi/NWLobCcLoMo/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGIgYihiMA8=&rs=AOn4CLAW0gFPpHpvYClwh0GDhRgbzI_M8Q",
        "twitter:app:id:googleplay": "com.google.android.youtube",
        "al:ios:app_store_id": "544007664",
        "twitter:site": "@youtube",
        "scrapeId": "ac46552d-97f4-4f1b-83c8-d2d6538ed19f",
        "sourceURL": "https://www.youtube.com/watch?v=NWLobCcLoMo",
        "url": "https://www.youtube.com/watch?v=NWLobCcLoMo",
        "statusCode": 200,
        "contentType": "text/html; charset=utf-8",
        "proxyUsed": "basic",
        "postprocessorsUsed": [
          "youtube"
        ],
        "creditsUsed": 1
      },
      "extractedAt": "2025-09-23T21:51:13.049Z"
    }
  ],
  "errors": []
}